## 🧾 Terraform Plan for `gov_accessanalyzer`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.iam_access_analyzer.aws_accessanalyzer_analyzer.this[0] will be created
  + resource "aws_accessanalyzer_analyzer" "this" {
      + analyzer_name = "prod-access-analyzer"
      + arn           = (known after apply)
      + id            = (known after apply)
      + tags          = {
          + "Env"     = "prod"
          + "Project" = "GovernanceBooster"
        }
      + tags_all      = {
          + "Env"     = "prod"
          + "Project" = "GovernanceBooster"
        }
      + type          = "ACCOUNT"
    }

  # module.iam_access_analyzer_advanced.aws_accessanalyzer_analyzer.this[0] will be created
  + resource "aws_accessanalyzer_analyzer" "this" {
      + analyzer_name = "org-analyzer"
      + arn           = (known after apply)
      + id            = (known after apply)
      + tags          = {
          + "Environment" = "production"
          + "Team"        = "security"
        }
      + tags_all      = {
          + "Environment" = "production"
          + "Team"        = "security"
        }
      + type          = "ORGANIZATION"
    }

  # module.iam_access_analyzer_advanced.aws_accessanalyzer_archive_rule.this[0] will be created
  + resource "aws_accessanalyzer_archive_rule" "this" {
      + analyzer_name = "org-analyzer"
      + id            = (known after apply)
      + rule_name     = "suppress-public-s3"

      + filter {
          + contains = (known after apply)
          + criteria = "isPublic"
          + eq       = [
              + "true",
            ]
          + exists   = (known after apply)
          + neq      = (known after apply)
        }
      + filter {
          + contains = (known after apply)
          + criteria = "resourceType"
          + eq       = [
              + "AWS::S3::Bucket",
            ]
          + exists   = (known after apply)
          + neq      = (known after apply)
        }
    }

  # module.iam_access_analyzer_advanced.aws_cloudwatch_event_rule.access_analyzer_findings[0] will be created
  + resource "aws_cloudwatch_event_rule" "access_analyzer_findings" {
      + arn            = (known after apply)
      + description    = "Capture IAM Access Analyzer findings"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "Access Analyzer Finding",
                ]
              + source      = [
                  + "aws.access-analyzer",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "access-analyzer-findings"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.iam_access_analyzer_advanced.aws_cloudwatch_event_target.send_to_sns[0] will be created
  + resource "aws_cloudwatch_event_target" "send_to_sns" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "access-analyzer-findings"
      + target_id      = "sns"
    }

  # module.iam_access_analyzer_advanced.aws_config_config_rule.s3_public_block[0] will be created
  + resource "aws_config_config_rule" "s3_public_block" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "s3-bucket-public-read-prohibited"
      + rule_id  = (known after apply)
      + tags_all = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "S3_BUCKET_PUBLIC_READ_PROHIBITED"
        }
    }

  # module.iam_access_analyzer_advanced.aws_config_configuration_recorder.this[0] will be created
  + resource "aws_config_configuration_recorder" "this" {
      + id       = (known after apply)
      + name     = "config"
      + role_arn = (known after apply)
    }

  # module.iam_access_analyzer_advanced.aws_config_delivery_channel.this[0] will be created
  + resource "aws_config_delivery_channel" "this" {
      + id             = (known after apply)
      + name           = "default"
      + s3_bucket_name = "my-config-log-bucket"
    }

  # module.iam_access_analyzer_advanced.aws_iam_role.config_role[0] will be created
  + resource "aws_iam_role" "config_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "config.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "config-recorder-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam_access_analyzer_advanced.aws_s3_bucket.config_logs[0] will be created
  + resource "aws_s3_bucket" "config_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-config-log-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.iam_access_analyzer_advanced.aws_sns_topic.this[0] will be created
  + resource "aws_sns_topic" "this" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "access-analyzer-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.iam_access_analyzer_advanced.aws_sns_topic_subscription.email[0] will be created
  + resource "aws_sns_topic_subscription" "email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "security@example.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

Warning: Attribute Deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->